Repository: abdulrahmanal-tayeb/ygc_reports
Catalog: lib/l10n/app_*.arb
Languages: ar

# createReportScreenTitle
source: Create Report
ar: إنشاء تقرير

# pickReportScreenTitle
source: Pick a Report
ar: اختيار تقرير

# savedReportScreenTitle
source: Saved Reports
ar: التقارير المحفوظة

source: Emptying Report
ar: تقرير تصفيه

# generatedByAmtCode
source: Generated using YGC Reports from AmtCode.
ar: تم إنشاؤه باستخدام برنامج YGC Reports من AmtCode.

source: Draft Reports
ar: مسودات التقارير

source: Submitted Reports
ar: التقارير التي تم ارسالها

source: Report Preview
ar: معاينة التقرير

source: Sign Below
ar: اضف توقيعك تحت هنا

# message_draftSaved
source: Saved as Draft
ar: تم الحفظ كمسودة

# message_noReports
source: No Reports Available
ar: لاتوجد تقارير حالياً

# message_reportDeleted
source: Report Deleted
ar: تم حذف التقرير

# message_deleteReport
source: Delete Report
ar: حذف التقرير

# message_deleteDraft
source: Delete Draft
ar: حذف المسودة

# error_required
source: This field is required
ar: يجب تعبئة هذا الحقل

# error_positiveNumber
source: This field must be a positive number
ar: ارقام موجبة فقط

# error_incorrectReading
source: This reading is incorrect.
ar: يجب ان تكون قراءة نهاية العمل اكبر من او تساوي قراءة بداية العمل

# error_onlyNumbers
source: Only numbers are accepted
ar: يرجى ادخال ارقام صحيحة

# error_numberLimitExceeded
source: This value should not exceed {maxNumber}
ar: يجب ان لا تزيد القيمة عن{maxNumber}

# hint_prefilledReport
source: Prefilled from previous report
ar: تمت التعبئة تلقائياً من تقرير سابق

# hint_consumed
source: Consumed: {liters, plural, =0{0 Liters} =1{1 Liter} other{{liters} Liters}}
ar: الكمية المنصرفة: {liters, plural, =0{٠ لتر} =1{١ لتر} other{{liters} لتر}}

# section_metadata
source: Metadata
ar: بيانات التقرير

# section_stationStatus
source: Station Status
ar: حالة المحطة

# section_pumpReadings
source: Pump Readings
ar: قراءات الطرمبة

# section_notes
source: Notes
ar: ملاحظات

# section_workers
source: Workers
ar: الموظفون

# section_stationWorker
source: Station Worker
ar: عامل المحطة

# section_representative
source: YGC Representative
ar: مندوب الشركة اليمنية للغاز

# field_stationName
source: Station Name
ar: اسم المحطة

# field_date
source: Date
ar: التاريخ

# field_beginTime
source: Begin Time
ar: بداية الدوام

# field_endTime
source: End Time
ar: نهاية الدوام

# field_tankLoad
source: Tank Load
ar: الكمية المرحلة في الخزان

# field_inboundAmount
source: Inbound Amount
ar: الكمية المفرغة

# field_totalLoad
source: Total Load
ar: إجمالي رصيد الخزان

# field_startReading
source: Start Reading
ar: القراءة بداية العمل

# field_endReading
source: End Reading
ar: القراءة نهاية العمل

# field_filledForPeople
source: Filled For People (L)
ar: الكمية المعبّأه للمواطنين (لتر)

# field_notes
source: Notes
ar: ملاحظات

# field_workerName
source: Worker Name
ar: اسم عامل المحطة

# field_representativeName
source: Representative Name
ar: اسم مندوب الشركة

# common_create
source: Create
ar: إنشاء

# common_addRow
source: Add Row
ar: إضافة قراءه

# common_sign
source: Sign
ar: اضف توقيع

# common_cancel
source: Cancel
ar: إلغاء

# common_delete
source: Delete
ar: حذف

# common_share
source: Share
ar: مشاركة

# common_clear
source: Clear
ar: مسح

# common_save
source: Save
ar: حفظ

# common_saveAndShare
source: Save & Share
ar: حفظ ومشاركة

# common_fromLastReport
source: From Last Report
ar: ملء من التقرير الأخير

# common_fromPreviousReport
source: From Previous Report
ar: ملء من تقرير سابق

# common_saveDraft
source: Save Draft
ar: حفظ كمسودة

# common_newReport
source: New Report
ar: تقرير جديد

# common_shareAsPDF
source: Share as PDF
ar: مشاركة بصيغة PDF

# common_shareAsImage
source: Share as Image
ar: مشاركة كصورة
